remove_design -all

read_file -format vhdl  ../source/my_DFF.vhd
analyze -library WORK -format vhdl {../source/my_DFF.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/my_nDFF.vhd
analyze -library WORK -format vhdl {../source/my_nDFF.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/my_adder.vhd
analyze -library WORK -format vhdl {../source/my_adder.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/my_nadder.vhd
analyze -library WORK -format vhdl {../source/my_nadder.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/partA.vhd
analyze -library WORK -format vhdl {../source/partA.vhd}


#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/partB.vhd
analyze -library WORK -format vhdl {../source/partB.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/partC.vhd
analyze -library WORK -format vhdl {../source/partC.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/partD.vhd
analyze -library WORK -format vhdl {../source/partD.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/ALSU.vhd
analyze -library WORK -format vhdl {../source/ALSU.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/data_ram.vhd
analyze -library WORK -format vhdl {../source/data_ram.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/inst_ram.vhd
analyze -library WORK -format vhdl {../source/inst_ram.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/memory_access.vhd
analyze -library WORK -format vhdl {../source/memory_access.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/write_back.vhd
analyze -library WORK -format vhdl {../source/write_back.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/reg_file.vhd
analyze -library WORK -format vhdl {../source/reg_file.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/execute.vhd
analyze -library WORK -format vhdl {../source/execute.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/CU.vhd
analyze -library WORK -format vhdl {../source/CU.vhd}

#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
read_file -format vhdl  ../source/CPU.vhd
analyze -library WORK -format vhdl {../source/CPU.vhd}
elaborate CPU -architecture arch -library WORK
link
check_design
source ../source/constrains.sdc		
compile -exact_map
report_area > ../results/area
report_timing > ../results/timing
rc > ../results/violations

report_clock -skew
report_qor
write -hierarchy -format verilog -output ../results/cpu.v
set_case_analysis 0 [get_ports rst]

report_constraint -all_violators -significant_digits 4 > ../results/post_min_constr.rpt
report_timing -delay min -nworst 40 -significant_digits 4 > ../results/post_min_timing.rpt
write_sdf ../results/post_min.sdf

report_timing -delay max -nworst 40 -significant_digits 4 > ../results/post_max_timing.rpt
write_sdf ../results/post_max.sdf
